In [1]:
import mysql.connector
import pandas as pd

In [2]:
host = 'localhost'
user = 'root'
password = 'shan12345'
database='imdb'


connection = mysql.connector.connect(
    host=host,
    user=user,
    password=password,
    database=database
)


cursor = connection.cursor()


show_tables_query = 'SHOW TABLES'
cursor.execute(show_tables_query)


tables = cursor.fetchall()

#dictionary to store DataFrames
dataframes = {}

# Iterate through each table and create a DataFrame
for table in tables:
    table_name = table[0]
    query = f'SELECT * FROM {table_name}'
    dataframe = pd.read_sql(query, connection)
    dataframes[table_name] = dataframe

# Display the DataFrames
for table_name, dataframe in dataframes.items():
    print(f" '{table_name}':")
    print(dataframe.head())

 'actors':
   id first_name           last_name gender
0   2    Michael  'babeepower' Viera      M
1   3       Eloy         'Chincheta'      M
2   4   Dieguito         'El Cigala'      M
3   5    Antonio    'El de Chipiona'      M
4   6       José        'El Francés'      M
 'directors':
   id first_name    last_name
0   1       Todd            1
1   2        Les  12 Poissons
2   3    Lejaren     a'Hiller
3   4       Nian            A
4   5   Khairiya    A-Mansour
 'directors_genres':
   director_id        genre  prob
0            2        Short   1.0
1            3        Drama   1.0
2            5  Documentary   1.0
3            6        Drama   1.0
4            6        Short   1.0
 'movies':
   id                                 name  year  rankscore
0   0                                  #28  2002        NaN
1   1  #7 Train: An Immigrant Journey, The  2000        NaN
2   2                                    $  1971        6.4
3   3                        $1,000 Reward  1913        NaN
4   4                        $1,000 Reward  1915        NaN
 'movies_directors':
   director_id  movie_id
0            1    378879
1            2    281325
2            3     30621
3            3    304743
4            4     60570
 'movies_genres':
   movie_id        genre
0         1  Documentary
1         1        Short
2         2       Comedy
3         2        Crime
4         5      Western
 'roles':
   actor_id  movie_id              role
0         2    280088            Stevie
1         2    396232  Various/lyricist
2         3    376687          Gitano 1
3         4    336265         El Cigala
4         5    135644           Himself

In [3]:
print(f"\nDataFrame for table 'actors':")
print(dataframe.head())

DataFrame for table 'actors':
   actor_id  movie_id              role
0         2    280088            Stevie
1         2    396232  Various/lyricist
2         3    376687          Gitano 1
3         4    336265         El Cigala
4         5    135644           Himself